blogs/mapreduce.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-11 一 12:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>MapReduce 使用经验</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MapReduce 使用经验</h1>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">1</span> 陷阱</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Mutability</h3>
<div class="outline-text-3" id="text-1-1">
<p>
所有 <b>Writable</b> 类型都是可变的，例如Text，LongWritable等，不要保持对他们的引用，甚至 <code>for (Text value : values)</code> 都不能保持对value的引用，因为它们都指向同一个对象。
</p>

<p>
看下面的代码，values是reduce的第二个参数，这样写正确吗？
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ff00;">Text</span> <span style="color: #ffff00;">max</span> = <span style="color: #ff00ff;">null</span>;
<span style="color: #00ffff; font-weight: bold;">for</span> (<span style="color: #00ff00;">Text</span> <span style="color: #ffff00;">value</span> : values) {
  <span style="color: #00ffff; font-weight: bold;">if</span> (max == <span style="color: #ff00ff;">null</span>) max = value;
  <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span> (max.getLength() &lt; value.getLength()) max = value;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 运行上下文</h3>
<div class="outline-text-3" id="text-1-2">
<p>
我非常好奇为什么 <b>Configuration</b> 不能设置value是 <b>Object</b> 呢？因为我想在 <b>main</b> 里初始化一个对象，然后在map和reduce里面使用，后来发现不支持，于是我把它做成一个单例。在 <b>local</b> 模式下竟然可以运行，可是在 <b>distributed</b> 模式下不行，为什么？
</p>

<p>
因为 <b>local</b> 模式， <b>main</b> <b>map</b> <b>reduce</b> 全在一个进程中运行， <b>main</b> 中初始化的单例对象， <b>map</b> 和 <b>reduce</b> 中可以使用。而在 <b>distributed</b> 模式下，这三者在不同机器的不同进程中运行，它们逻辑上是一个程序，但运行上是三个程序。只可以在 <b>main</b> 中设置 <b>Configuration</b> ， <b>map 和 *reduce</b> 中读取里面的值。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> LOGGER</h3>
<div class="outline-text-3" id="text-1-3">
<p>
在mapreduce程序中可以像通常的java程序一样使用 <b>slf4j</b> 等工具打印日志，但是在具体的 <b>Mapper</b> 和 <b>Reducer</b> 中不建议打印日志（含System.out），巨慢无比，可以使用 <b>Counter</b> 等排查工具，或者把文件复制到本地，用local模式运行。另外查看 <b>Mapper</b> 和 <b>Reduce</b> 中的日志，无法在标准输出中看到，应该在任务控制台看。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> 强制结束mapreduce程序</h3>
<div class="outline-text-3" id="text-1-4">
<p>
在命令行用 <b>Ctrl-C</b> 或者 <b>kill</b> 没办法真的停止mapreduce程序，必须使用专门的命令 <code>yarn application -kill &lt;application-id&gt;</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> 使用 hadoop fs -copyFromLocal 复制文件</h3>
<div class="outline-text-3" id="text-1-5">
<p>
如果并发的向hadoop复制同一个文件，导致错误。 <code>hdfs.DFSClient: DataStreamer Exception org.apache.hadoop.ipc.RemoteException(org.apache.hadoop.hdfs.server.namenode.LeaseExpiredException): No lease on /user/test/2017-12-11-09_log._COPYING_ (inode 252293331): File does not exist</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">2</span> 技巧</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.1</span> 在Java7平台运行Java8应用</h3>
<div class="outline-text-3" id="text-2-1">
<p>
当Hadoop、yarn和应用使用的Java版本不同时，需要配置应用自己的 <code>JAVA_HOME</code> （联想MapReduce的工作流程，想想为什么这样是可行的）， <code>-D yarn.app.mapreduce.am.env=JAVA_HOME=/path_to_java8 -D mapreduce.admin.user.env=JAVA_HOME=/path_to_java8</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.2</span> <b>local</b> 配置优化</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">2.2.1</span> 加大java内存配置</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
修改 <code>hadoop-env.sh</code> 的 <code>HADOOP_CLIENT_OPTS</code> 例如：~export HADOOP<sub>CLIENT</sub><sub>OPTS</sub>="-Xmx1024m $HADOOP<sub>CLIENT</sub><sub>OPTS</sub>"~
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">2.2.2</span> 修改tmp目录到大磁盘</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
修改 <code>mapred-site.xml</code> 的 <code>mapreduce.cluster.local.dir</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">3</span> avro</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>avro</code> 是类似于 <code>protobuf</code> 的序列化机制，支持在mapreduce中使用。除了有schema外，avro降低了文件的大小。
</p>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.1</span> <b>local</b> 模式注意事项</h3>
<div class="outline-text-3" id="text-3-1">
<p>
hadoop内置了avro的lib，这个可能和应用使用的avro版本不一致，在 <b>local</b> 模式下需要配置两个环境变量。
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #0000ff; font-weight: bold;">export</span> <span style="color: #ffff00;">HADOOP_CLASSPATH</span>=/path_to_you_jar
<span style="color: #0000ff; font-weight: bold;">export</span> <span style="color: #ffff00;">HADOOP_USER_CLASSPATH_FIRST</span>=true
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.2</span> 修改模式</h3>
<div class="outline-text-3" id="text-3-2">
<p>
新增字段时，为了兼容老数据，需要指定 <code>default</code> ，如果 <code>type</code> 是多个类型，则 <code>default</code> 类型必须和第一个相同，例如：
</p>
<pre class="example">
{"name": "uid", "type": ["null", "string"], "default": null}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-12-11 一 12:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
